Revit 2026 API

# SpaceActualSupplyAirflow Property

---

Get the Actual Supply Airflow of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ActualSupplyAirflow { get; }
```
```vb
Public ReadOnly Property ActualSupplyAirflow As Double
	Get
```
```cpp
public:
property double ActualSupplyAirflow {
	double get ();
}
```
```fsharp
member ActualSupplyAirflow : float with get
```

#### Property Value

Double

This property is used to get the Actual Supply Airflow (Unit: CFM) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace